#ifndef BASEBAND_ALPS_FM_REG_H
#define BASEBAND_ALPS_FM_REG_H


/*--- ADDRESS ------------------------*/
#define BB_REG_BASEADDR                 0xC00000

#define BB_REG_SYS_BASEADDR             (BB_REG_BASEADDR+0x000)
#define BB_REG_AGC_BASEADDR             (BB_REG_BASEADDR+0x200)
#define BB_REG_SAM_BASEADDR             (BB_REG_BASEADDR+0x400)
#define BB_REG_FFT_BASEADDR             (BB_REG_BASEADDR+0x600)
#define BB_REG_CFR_BASEADDR             (BB_REG_BASEADDR+0x800)
#define BB_REG_DOA_BASEADDR             (BB_REG_BASEADDR+0xa00)
#define BB_REG_DBG_BASEADDR             (BB_REG_BASEADDR+0xc00)
#define BB_REG_DML_BASEADDR             (BB_REG_BASEADDR+0xe00)

/*sys register*/
#define BB_REG_SYS_START                (BB_REG_SYS_BASEADDR+0x0)
#define BB_REG_SYS_BNK_MODE             (BB_REG_SYS_BASEADDR+0x4)
#define BB_REG_SYS_BNK_ACT              (BB_REG_SYS_BASEADDR+0x8)
#define BB_REG_SYS_BNK_QUE              (BB_REG_SYS_BASEADDR+0xC)
#define BB_REG_SYS_BNK_RST              (BB_REG_SYS_BASEADDR+0x10)
#define BB_REG_SYS_MEM_ACT              (BB_REG_SYS_BASEADDR+0x14)
#define BB_REG_SYS_ENABLE               (BB_REG_SYS_BASEADDR+0x18)
#define BB_REG_SYS_TYPE_FMCW            (BB_REG_SYS_BASEADDR+0x1C)
#define BB_REG_SYS_SIZE_RNG_PRD         (BB_REG_SYS_BASEADDR+0x20)
#define BB_REG_SYS_SIZE_FLT             (BB_REG_SYS_BASEADDR+0x24)
#define BB_REG_SYS_SIZE_RNG_SKP         (BB_REG_SYS_BASEADDR+0x28)
#define BB_REG_SYS_SIZE_RNG_BUF         (BB_REG_SYS_BASEADDR+0x2C)

#define CFR_TYPE_CMB_DBPM 2
#define CFR_TYPE_CMB_MUSIC 3
#define CFR_TYPE_DEC_CA 0
#define CFR_TYPE_DEC_OS 1
#define CFR_TYPE_DEC_CA_AND_OS 2
#define CFR_TYPE_DEC_CA_OR_OS 3

#define DOA_MODE_NORMAL 0
#define DOA_MODE_CASCADE 1
#define DOA_TYPE_DBF 0
#define DOA_TYPE_RESERVED 1
#define DOA_TYPE_DML 2

#define DBG_MAP_RLT_BOPS 0
#define DBG_MAP_RLT_BPSO 1
#define DBG_BUF_TAR_NONE 0
#define DBG_BUF_TAR_ADC (1<<0)
#define DBG_BUF_TAR_FFT_1D (1<<1)
#define DBG_BUF_TAR_FFT_2D (1<<2)
#define DBG_BUF_TAR_CFR (1<<3)
#define DBG_BUF_TAR_BFM (1<<4)
#define DBG_BUF_TAR_CPU (1<<5)

#define ECC_MODE_OFF  0
#define ECC_MODE_SB   1
#define ECC_MODE_DB   2 /* DB err should occur in cfr_buf & top_mac */

#define ADC_MODE_SAM   0
#define ADC_MODE_HIL   1 /* HIL is only supported under "DIRECT" FFT_MODE */


#define BB_MEM_BASEADDR                 0xE00000
#define BB_MEM_BASEADDR_CH_OFFSET       0x040000 /* TODO: check the usage in bb_dc_command in baseband_cli.c*/

#define MEM_SIZE_COD_WD 6
#define MEM_DATA_COE_WD 28

#define SYS_SIZE_ANT 4
#define SYS_DATA_ADC_WD 13
#define SYS_DATA_WIN_WD 16
#define SYS_DATA_FFT_WD 26
#define SYS_DATA_COM_WD 32
#define SYS_DATA_SIG_WD 20
#define AGC_DATA_COD_WD 9
#define AGC_DATA_GAI_WD 8
#define SAM_DATA_COE_WD 8
#define SAM_DATA_SCL_WD 10
#define FFT_DATA_AMB_WD 4
#define FFT_DATA_COE_WD 14
#define CFR_SIZE_MIM_WD 4

#define ANT_NUM 4
#define SYS_SIZE_RNG_WD 11  /* defined in RTL */
#define SYS_SIZE_VEL_WD 10  /* defined in RTL */
/* name sync with ALPS_A */
#define SYS_BUF_STORE_ADC SAM_SINKER_BUF
#define SYS_BUF_STORE_FFT SAM_SINKER_FFT

#define BB_IRQ_ENABLE_ALL                        0x7
#define BB_IRQ_CLEAR_ALL                         0x7
#define BB_IRQ_ENABLE_SAM_DONE                   0x4
#define BB_IRQ_CLEAR_SAM_DONE                    0x4
#define BB_IRQ_ENABLE_BB_DONE                    0x1
#define BB_ECC_ERR_CLEAR_ALL                     0x7ff

#define SYS_SIZE_OBJ_WD                          10    /* maximal object number is 1024 for all bank */
#define SYS_SIZE_OBJ_WD_BNK                      8     /* maximal object number is 256 for each bank */
#define SYS_SIZE_OBJ_BNK                         256   /* maximal object number is 256 for each bank */
#define RESULT_SIZE                              128   /* 128 bytes */

#define DMP_FFT_1D             1 /* fft1d data dump */
#define DMP_FFT_2D             2 /* fft2d data dump */

/* frame interleaving loop pattern */
#define FIXED                0   /* fixed */
#define ROTATE               1   /* loop */
#define AIR_CONDITIONER      2   /* special scene of air conditioner */
#define VELAMB               3   /* special scene of velocity ambiguity*/

#define CFG_0                0   /* frame interleaving config 0 */
#define CFG_1                1   /* frame interleaving config 1 */
#define CFG_2                2   /* frame interleaving config 2 */
#define CFG_3                3   /* frame interleaving config 3 */

/*--- TYPEDEF ( to match newest RTL )-------------------------*/
typedef struct {
        uint32_t ang_acc_0   : 4  ; /* 0x00 */
        uint32_t ang_idx_0   : 9  ;
        uint32_t ang_vld_0   : 1  ;
        uint32_t ang_dummy_0 : 18 ;
        uint32_t sig_0       : 20 ; /* 0x04 */
        uint32_t sig_dummy_0 : 12 ;

        uint32_t ang_acc_1   : 4  ; /* 0x08 */
        uint32_t ang_idx_1   : 9  ;
        uint32_t ang_vld_1   : 1  ;
        uint32_t ang_dummy_1 : 18 ;
        uint32_t sig_1       : 20 ; /* 0x0c */
        uint32_t sig_dummy_1 : 12 ;

        uint32_t ang_acc_2   : 4  ; /* 0x10 */
        uint32_t ang_idx_2   : 9  ;
        uint32_t ang_vld_2   : 1  ;
        uint32_t ang_dummy_2 : 18 ;
        uint32_t sig_2       : 20 ; /* 0x14 */
        uint32_t sig_dummy_2 : 12 ;

        uint32_t ang_acc_3   : 4  ; /* 0x18 */
        uint32_t ang_idx_3   : 9  ;
        uint32_t ang_vld_3   : 1  ;
        uint32_t ang_dummy_3 : 18 ;
        uint32_t sig_3       : 20 ; /* 0x1c */
        uint32_t sig_dummy_3 : 12 ;
} doa_info_t;


typedef struct {
        uint32_t vel_acc      : 4  ; /* 0x00 */
        uint32_t vel_idx      : 10 ;
        uint32_t rng_acc      : 4  ;
        uint32_t rng_idx      : 10 ;
        uint32_t dummy_0      : 4  ;

        uint32_t noi          : 20 ; /* 0x04 */
        uint32_t amb_idx      : 5  ;
        uint32_t dummy_1      : 7  ;

        doa_info_t doa[3]          ;
        uint32_t dummy[6]          ;
} obj_info_t; /* 32 words(4 bytes) in all */

typedef struct {
        uint32_t vel_acc      : 4  ; /* 0x00 */
        uint32_t vel_idx      : 10 ;
        uint32_t rng_acc      : 4  ;
        uint32_t rng_idx      : 10 ;
        uint32_t dummy_0      : 4  ;

        uint32_t noi          : 20 ; /* 0x04 */
        uint32_t amb_idx      : 5  ;
        uint32_t dummy_1      : 7  ;

} cfr_info_t;

#define NOI_AMB_REODER          5
#define NOI_AMB_OFFSET          1

#endif /* BASEBAND_ALPS_FM_REG_H_ */
